data_generation/loadTest.yml
config:
  target: 'http://0.0.0.0:4568'
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 100
      name: "Warm up"
    - duration: 60
      arrivalRate: 100
      name: "Sustained light load"
    - duration: 30
      arrivalRate: 100
      rampTo: 500
      name: "Warm up to max load"
    - duration: 60
      arrivalRate: 500
      name: "Sustained max"
  payload:
    - path: "./users.csv"
      fields:
        - "user_id"
scenarios:
  - flow:
    - post:
        url: "/"
        body: "{{user_id}}"